Predicting the survivors using logistic regression

In [6]:
import pandas as pd

In [7]:
df = pd.read_csv('tested.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [10]:
# we can drop passenger id, name
df.drop(['PassengerId'],axis=1,inplace=True)
df.drop(['Name'],axis=1,inplace=True)

df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,34.5,0,0,330911,7.8292,NaN,Q
1,1,3,female,47.0,1,0,363272,7.0000,NaN,S
2,0,2,male,62.0,0,0,240276,9.6875,NaN,Q
3,0,3,male,27.0,0,0,315154,8.6625,NaN,S
4,1,3,female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
413,0,3,male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1,1,female,39.0,0,0,PC 17758,108.9000,C105,C
415,0,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,0,3,male,NaN,0,0,359309,8.0500,NaN,S
417,0,3,male,NaN,1,1,2668,22.3583,NaN,C

In [11]:
df['Sex'] = df['Sex'].map({'male':1,'female':0})
df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,1,34.5,0,0,330911,7.8292,NaN,Q
1,1,3,0,47.0,1,0,363272,7.0000,NaN,S
2,0,2,1,62.0,0,0,240276,9.6875,NaN,Q
3,0,3,1,27.0,0,0,315154,8.6625,NaN,S
4,1,3,0,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
413,0,3,1,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1,1,0,39.0,0,0,PC 17758,108.9000,C105,C
415,0,3,1,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,0,3,1,NaN,0,0,359309,8.0500,NaN,S
417,0,3,1,NaN,1,1,2668,22.3583,NaN,C

In [12]:
df['Cabin'].unique()

array([nan, 'B45', 'E31', 'B57 B59 B63 B66', 'B36', 'A21', 'C78', 'D34',
       'D19', 'A9', 'D15', 'C31', 'C23 C25 C27', 'F G63', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C101', 'C55 C57', 'B71', 'C46', 'C116',
       'F', 'A29', 'G6', 'C6', 'C28', 'C51', 'E46', 'C54', 'C97', 'D22',
       'B10', 'F4', 'E45', 'E52', 'D30', 'B58 B60', 'E34', 'C62 C64',
       'A11', 'B11', 'C80', 'F33', 'C85', 'D37', 'C86', 'D21', 'C89',
       'F E46', 'A34', 'D', 'B26', 'C22 C26', 'B69', 'C32', 'B78',
       'F E57', 'F2', 'A18', 'C106', 'B51 B53 B55', 'D10 D12', 'E60',
       'E50', 'E39 E41', 'B52 B54 B56', 'C39', 'B24', 'D28', 'B41', 'C7',
       'D40', 'D38', 'C105'], dtype=object)

In [13]:
df['Age'].isnull().sum()

86

In [14]:
df['Age'].describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [16]:
df['Age'].fillna(value = df['Age'].mean(), inplace=True)
df['Age']

0      34.50000
1      47.00000
2      62.00000
3      27.00000
4      22.00000
         ...
413    30.27259
414    39.00000
415    38.50000
416    30.27259
417    30.27259
Name: Age, Length: 418, dtype: float64

In [18]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
Embarked      0
dtype: int64

In [19]:
df[df['Fare'].isnull()]

     Survived  Pclass  Sex   Age  SibSp  Parch Ticket  Fare Cabin Embarked
152         0       3    1  60.5      0      0   3701   NaN   NaN        S

In [20]:
df['Fare'].describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

In [21]:
df['Fare'].fillna(value = df['Fare'].mean(), inplace=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  418 non-null    int64
 1   Pclass    418 non-null    int64
 2   Sex       418 non-null    int64
 3   Age       418 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      418 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(5), object(3)
memory usage: 32.8+ KB

In [24]:
df.drop(['Ticket'], axis=1 , inplace=True)
df.drop(['SibSp'], axis=1 , inplace=True)
df.drop(['Parch'], axis=1 , inplace=True)
df.drop(['Cabin'], axis=1 , inplace=True)

In [26]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [27]:
df['Embarked'] = le.fit_transform(df['Embarked'])

In [29]:
X = df.drop(['Survived'],axis=1)
y = df['Survived']

In [32]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(
X, y, test_size=0.2, random_state=10)

In [33]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier()

In [34]:
rfc.fit(X_train,y_train)

RandomForestClassifier()

In [36]:
rfc.score(X_train,y_train)

1.0

In [37]:
rfc.score(X_test,y_test)   # 100 % accuracy

1.0

In [40]:
X_test

     Pclass  Sex       Age     Fare  Embarked
362       2    0  31.00000  21.0000         2
154       3    1  13.00000  31.3875         2
47        3    1  30.27259   7.7500         1
100       1    0  43.00000  55.4417         0
187       3    1  17.00000   8.0500         2
..      ...  ...       ...      ...       ...
99        3    1  33.00000   8.0500         2
119       2    0  29.00000  26.0000         2
275       2    0  20.00000  26.0000         2
319       2    1  22.00000  31.5000         2
390       1    1  23.00000  93.5000         2

[84 rows x 5 columns]

In [39]:
X_train.shape

(334, 5)

In [46]:
df.iloc[362]

Survived     1.0
Pclass       2.0
Sex          0.0
Age         31.0
Fare        21.0
Embarked     2.0
Name: 362, dtype: float64

In [42]:
rfc.predict([[2,0,31.00000,21.0000,2]])
# as you can see from the above case the values predicted by this model is vary corret

c:\Users\Harshit\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)